// написать программу, которая на вход принимает число и умножает его на себя(возводит в квадрат)

Console.WriteLine("Введите число: ");
int number = int.Parse(Console.ReadLine()!);
Console.WriteLine(number * number);